Documents/ЛБ_ОтменитьШаблонПриказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ОтменитьШаблонПриказа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_УстановкаОтменаШаблонаПриказа</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийУстановитьШаблонПриказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЛомбарды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПриказа</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_УстановитьШаблонПриказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаБезНулей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_УстановкаОтменаШаблонаПриказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_УстановкаОтменаШаблонаПриказа</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонПриказа</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_УстановитьШаблонПриказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидШаблона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийУстановитьШаблонПриказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийУстановитьШаблонПриказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийУстановитьШаблонПриказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроцентныеСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Металлы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентныеСтавкиАкция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_ОтменитьШаблонПриказа/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;   
	Если УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
		ЭтоСуперпользователь = Истина;
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавки;    
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
	ЗаполнитьСписокЛомбардов();
	УстановитьВидимостьПоВидуОперации(); 
	УстановитьСостояниеДокумента();
	
	Если Объект.Проведен Тогда  
		ЭтаФорма.ТолькоПросмотр = Истина;  
		Элементы.СписокЛомбардов.ТолькоПросмотр = Истина;
	КонецЕсли;	

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//+МАН 18.03.26 Убрал. Заявка 3654
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	//-МАН
    ТекущаяОперация = Объект.ВидОперации;

	//+МАН 17.03.26 Изменение заголовка формы. Заявка 3654.
	УстановитьЗаголовокФормы();
	//-МАН
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры   
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьВидимостьПоВидуОперации()
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавки Тогда 
		Элементы.Акция.Видимость = Ложь;
		Элементы.СхемаКредитования.Видимость = Истина; 
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Металлы Тогда 
		Элементы.Акция.Видимость = Ложь;
		Элементы.СхемаКредитования.Видимость = Ложь; 
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.Вставки Тогда
		Элементы.Акция.Видимость = Ложь;
		Элементы.СхемаКредитования.Видимость = Ложь; 
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавкиАкция Тогда
		Элементы.Акция.Видимость = Истина;
		Элементы.СхемаКредитования.Видимость = Ложь; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УстановитьВидимостьПоВидуОперации();      
	Если НЕ ТекущаяОперация = Объект.ВидОперации Тогда  
		ТекущаяОперация = Объект.ВидОперации;
	    Объект.ШаблонПриказа = ПредопределенноеЗначение("Документ.ЛБ_УстановитьШаблонПриказа.ПустаяСсылка"); 
		Если НЕ Объект.Ломбарды.Количество() = 0 Тогда
			ПолучитьДокументШаблона();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры          

&НаСервере
Функция ПолучитьСписокЛомбардов() 
	СписокЛ = Новый СписокЗначений; 
	Для каждого Стр Из Объект.ШаблонПриказа.Ломбарды Цикл
		Пометка = Ложь;
		Отбор = Новый Структура;
		Отбор.Вставить("Ломбард", Стр.Ломбард);  
		Строки = Объект.Ломбарды.НайтиСтроки(Отбор); 
		Если НЕ Строки.Количество() = 0 Тогда
			Пометка = Истина;
		КонецЕсли;	
	    СписокЛ.Добавить(Стр.Ломбард,,Пометка);
	Конеццикла; 
    Возврат СписокЛ;
КонецФункции	
	
&НаКлиенте
Процедура СписокЛомбардовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;                                                                       
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавки") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.СхемаКредитования) Тогда 
			Предупреждение("Выберите схему кредитования!", 60);
			Возврат;
		КонецЕсли;	
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавкиАкция") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Акция) Тогда 
			Предупреждение("Выберите акцию!", 60);
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Объект.Ломбарды); 
	ПараметрыФормы.Вставить("ДатаДок", Объект.Дата);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, Элементы.СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
	////Если НЕ ЗначениеЗаполнено(Объект.ШаблонПриказа) Тогда
	////	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбарда",ЭтаФорма);
	////	
	////	ОткрытьФорму("Справочник.ЛБ_Ломбарды.ФормаВыбора", , Элементы.СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	////Иначе 
	////	СписокЛ = ПолучитьСписокЛомбардов();	 
	////    ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект);	
	//// 
	////    СписокЛ.ПоказатьОтметкуЭлементов(
	////        ОповещениеПослеОтметкиЭлементов,
	////        "Выберите ломбарды"
	////    );
	////КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Объект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ?(НЕ ПустаяСтрока(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.НаименованиеПолное), СокрЛП(Стр.Ломбард.Наименование));
	КонецЦикла;	
	СписокЛомбардов = Результат;
	Объект.СтрокаЛомбарды = Результат;
КонецПроцедуры	

 
&НаКлиенте
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Объект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
	
	ЗаполнитьСписокЛомбардов();
	
	Если НЕ Объект.Ломбарды.Количество() = 0 Тогда
		ПолучитьДокументШаблона();  
		Если НЕ ЗначениеЗаполнено(Объект.ШаблонПриказа) Тогда 
			Предупреждение("Документ установки шаблона приказа в выбранных ломбардах не определен.", 60);
		КонецЕсли;	
	Иначе	
	    Объект.ШаблонПриказа = ПредопределенноеЗначение("Документ.ЛБ_УстановитьШаблонПриказа.ПустаяСсылка"); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиЭлементов(Элементы, Параметры) Экспорт
 
	Если Элементы <> Неопределено Тогда 
		Объект.Ломбарды.Очистить();
        Для Каждого Эл Из Элементы Цикл
			Если Эл.Пометка Тогда 
				НоваяСтр = Объект.Ломбарды.Добавить();
	            НоваяСтр.Ломбард = Эл.Значение;
            КонецЕсли;
		КонецЦикла; 
		ЗаполнитьСписокЛомбардов();
    КонецЕсли;
КонецПроцедуры

 
&НаКлиенте
Процедура ПослеВыбораЛомбарда(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	НоваяСтр = Объект.Ломбарды.Добавить();
	НоваяСтр.Ломбард = Результат;
	
	ЗаполнитьСписокЛомбардов();  
	
	ПолучитьДокументШаблона();  
	Если НЕ ЗначениеЗаполнено(Объект.ШаблонПриказа) Тогда 
		Предупреждение("Документ установки шаблона приказа в выбранных ломбардах не определен.", 60);
	КонецЕсли;	 
КонецПроцедуры

&НаСервере
Процедура ПолучитьДокументШаблона() 
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Дата", ?(НЕ ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДатаСеанса(), Объект.Дата));
	СписокЛ = Новый СписокЗначений;
	Для каждого СтрЛ Из Объект.Ломбарды Цикл 
		СписокЛ.Добавить(СтрЛ.Ломбард);
	КонецЦикла;	
	Запрос.УстановитьПараметр("Ломбарды", СписокЛ);
	Запрос.УстановитьПараметр("ВидШаблона", Объект.ВидОперации);
	ДопОтбор = "";
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавки Тогда
         ДопОтбор = "И СхемаКредитования = &СхемаКредитования";  
		 Запрос.УстановитьПараметр("СхемаКредитования", Объект.СхемаКредитования);
	ИначеЕсли Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийУстановитьШаблонПриказа.ПроцентныеСтавкиАкция Тогда
         ДопОтбор = "И Акция = &Акция"; 
		 Запрос.УстановитьПараметр("Акция", Объект.Акция);
	КонецЕсли; 
	Запрос.Текст = "ВЫБРАТЬ   
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.Ломбард КАК Ломбард,
	               |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.ШаблонПриказа КАК ШаблонПриказа, 
				   |	ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних.Отменен КАК Отменен
	               |ИЗ
	               |	РегистрСведений.ЛБ_УстановкаОтменаШаблонаПриказа.СрезПоследних(
	               |			&Дата,
	               |			ВидШаблона = &ВидШаблона
	               |				И Ломбард В (&Ломбарды) " + ДопОтбор + ") КАК ЛБ_УстановкаОтменаШаблонаПриказаСрезПоследних"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();  
	Если ТаблицаЗапроса.Количество() = 0 Тогда 
		Объект.ШаблонПриказа = Документы.ЛБ_УстановитьШаблонПриказа.ПустаяСсылка();
	Иначе	     
		Для каждого Эл Из СписокЛ Цикл  
			Отбор = Новый Структура;
			Отбор.Вставить("Ломбард", Эл.Значение);
			Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда
				НоваяСтр = ТаблицаЗапроса.Добавить();
				НоваяСтр.Ломбард = Эл.Значение;  
			КонецЕсли;	
		КонецЦикла;	

		ТаблицаДокументов = ТаблицаЗапроса.Скопировать();
		ТаблицаДокументов.Свернуть("ШаблонПриказа");
		Если ТаблицаДокументов.Количество() = 1 Тогда
			Выборка = ТаблицаЗапроса.Получить(0);
			Если Выборка.Отменен Тогда
				Объект.ШаблонПриказа = Документы.ЛБ_УстановитьШаблонПриказа.ПустаяСсылка();
			Иначе	
			    Объект.ШаблонПриказа = Выборка.ШаблонПриказа;
			КонецЕсли;	
		Иначе //разные шаблоны 
			ОбщегоНазначения.СообщитьПользователю("Для выбранных ломбардов установлены разные шаблоны приказа. Выбор шаблона для отмены неоднозначен."); 
			
			Для каждого СтрД Из ТаблицаДокументов Цикл 
				Отбор = Новый Структура;
				Отбор.Вставить("ШаблонПриказа", СтрД.ШаблонПриказа);  
				Строки = ТаблицаЗапроса.НайтиСтроки(Отбор); 
				СтрокаЛомбарды = "";
				Для каждого стр Из строки Цикл 
					СтрокаЛомбарды = СтрокаЛомбарды + ?(ПустаяСтрока(СтрокаЛомбарды), "", ", ") + СокрЛП(Стр.Ломбард);
				КонецЦикла;	   
				Если ЗначениеЗаполнено(СтрД.ШаблонПриказа) Тогда
			        ОбщегоНазначения.СообщитьПользователю(СтрокаЛомбарды + " шаблон приказа " +  СокрЛП(СтрД.ШаблонПриказа)); 
				Иначе
					ОбщегоНазначения.СообщитьПользователю(СтрокаЛомбарды + " шаблон приказа не установлен");
				КонецЕсли;	
			КонецЦикла;
           		
			Объект.ШаблонПриказа = Документы.ЛБ_УстановитьШаблонПриказа.ПустаяСсылка();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура СписокЛомбардовОчистка(Элемент, СтандартнаяОбработка)
	Объект.Ломбарды.Очистить();
	СписокЛомбардов = "";
	Объект.СтрокаЛомбарды = "";
	Объект.ШаблонПриказа = ПредопределенноеЗначение("Документ.ЛБ_УстановитьШаблонПриказа.ПустаяСсылка");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда 
		Если НЕ НачалоДня(ТекущийОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда
			Если НЕ ЭтоСуперпользователь Тогда 
				 Сообщить("Пользователь имеет право проводить документ только текущей датой. Измените дату документа.", статуссообщения.Важное);
			     Отказ = Истина;
				 Возврат;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьСостояниеДокумента();
	//+МАН 17.03.26 Изменение заголовка формы. Заявка 3654.
	УстановитьЗаголовокФормы();
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура СхемаКредитованияПриИзменении(Элемент)
	Если НЕ Объект.Ломбарды.Количество() = 0 Тогда
		ПолучитьДокументШаблона();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АкцияПриИзменении(Элемент)
	Если НЕ Объект.Ломбарды.Количество() = 0 Тогда
		ПолучитьДокументШаблона();
	КонецЕсли;
КонецПроцедуры

//+МАН 17.03.26 Изменение заголовка формы. Заявка 3654.
&НаСервере
Процедура УстановитьЗаголовокФормы()
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ЭтаФорма.Заголовок = "Отмена шаблона приказа №" + Параметры.Ключ.НомерДокументаБезНулей + " от " + Параметры.Ключ.Дата;
	Иначе
		ЭтаФорма.Заголовок = "Отмена шаблона приказа (создание)";
	КонецЕсли;
КонецПроцедуры
//-МАН
